In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'])
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

In [3]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date1'] = pd.to_datetime(df['date'], dayfirst=True)
df['date2'] = pd.to_datetime(df['date'])
df

        date  value      date1      date2
0  3/10/2000      2 2000-10-03 2000-03-10
1  3/11/2000      3 2000-11-03 2000-03-11
2  3/12/2000      4 2000-12-03 2000-03-12

In [4]:
# Custom format

In [5]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S")
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

In [7]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [8]:
df['date'] = pd.to_datetime(df)
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

In [9]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})
df['DoB'] = pd.to_datetime(df['DoB'])

In [10]:
df

    name        DoB
0    Tom 1997-08-05
1   Andy 1996-04-28
2  Lucas 1995-12-16

In [11]:
df['year']= df['DoB'].dt.year
df['month']= df['DoB'].dt.month
df['day']= df['DoB'].dt.day
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

In [12]:
df['week_of_year'] = df['DoB'].dt.week
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  year  month  day  week_of_year  day_of_week  is_leap_year
0    Tom 1997-08-05  1997      8    5            32            1         False
1   Andy 1996-04-28  1996      4   28            17            6          True
2  Lucas 1995-12-16  1995     12   16            50            5         False

In [13]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday

In [14]:
today = pd.to_datetime('today')
df['age'] = today.year - df['DoB'].dt.year
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,24
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,25
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,26

In [15]:
# Year difference
today = pd.to_datetime('today')
diff_y = today.year - df['DoB'].dt.year
# Haven't had birthday
b_md = df['DoB'].apply(lambda x: (x.month,x.day) )
no_birthday = b_md > (today.month,today.day)
df['age'] = diff_y - no_birthday
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,24
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,25
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,25

In [20]:
df = pd.read_csv('city_sales.csv',parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34764 entries, 0 to 34763
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    34764 non-null  datetime64[ns]
 1   num     34764 non-null  int64
 2   city    34764 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 814.9+ KB

In [21]:
df = df.set_index(['date'])
df.head()

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London

In [22]:
df.loc['2015']

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2015-04-27 12:57:00    3  London
2015-04-27 12:58:00    3  London
2015-04-27 12:59:00    3  London
2015-04-27 13:00:00    3  London
2015-04-27 13:01:00    2  London

[34764 rows x 2 columns]

In [23]:
df.loc['2015','num'].sum()

97316

In [24]:
df['2015'].groupby('city').sum()

          num
city
London  97316

In [26]:
df.loc['2015-1']

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2015-01-30 15:56:00    2  London
2015-01-30 15:57:00    4  London
2015-01-30 15:58:00    3  London
2015-01-30 15:59:00    3  London
2015-01-30 16:00:00    3  London

[9262 rows x 2 columns]

In [28]:
df.loc['2015-1-1']

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2015-01-01 15:56:00    3  London
2015-01-01 15:57:00    2  London
2015-01-01 15:58:00    3  London
2015-01-01 15:59:00    3  London
2015-01-01 16:00:00    4  London

[421 rows x 2 columns]

In [29]:
cond = df.index.month==2
df[cond]

                     num    city
date
2015-02-02 09:00:00    4  London
2015-02-02 09:01:00    3  London
2015-02-02 09:02:00    3  London
2015-02-02 09:03:00    2  London
2015-02-02 09:04:00    1  London
...                  ...     ...
2015-02-27 15:56:00    4  London
2015-02-27 15:57:00    4  London
2015-02-27 15:58:00    2  London
2015-02-27 15:59:00    2  London
2015-02-27 16:00:00    2  London

[8420 rows x 2 columns]

In [30]:
df.loc['2016' : '2018']

Empty DataFrame
Columns: [num, city]
Index: []

In [31]:
df.loc['2018-5-2 10' : '2018-5-2 11' ]

Empty DataFrame
Columns: [num, city]
Index: []

In [32]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45' ]

Empty DataFrame
Columns: [num, city]
Index: []

In [33]:
df.between_time('10:30','10:45')

                     num    city
date
2015-01-01 10:30:00    4  London
2015-01-01 10:31:00    3  London
2015-01-01 10:32:00    3  London
2015-01-01 10:33:00    3  London
2015-01-01 10:34:00    4  London
...                  ...     ...
2015-04-27 10:41:00    3  London
2015-04-27 10:42:00    3  London
2015-04-27 10:43:00    3  London
2015-04-27 10:44:00    2  London
2015-04-27 10:45:00    2  London

[1328 rows x 2 columns]

In [34]:
# missing values

In [35]:
df['rolling_sum'] = df.rolling(3).sum()
df.head()

                     num    city  rolling_sum
date
2015-01-01 09:00:00    4  London          NaN
2015-01-01 09:01:00    4  London          NaN
2015-01-01 09:02:00    3  London         11.0
2015-01-01 09:03:00    3  London         10.0
2015-01-01 09:04:00    3  London          9.0

In [36]:
df['rolling_sum_backfilled'] = df['rolling_sum'].fillna(method='backfill')
df.head()

                     num    city  rolling_sum  rolling_sum_backfilled
date
2015-01-01 09:00:00    4  London          NaN                    11.0
2015-01-01 09:01:00    4  London          NaN                    11.0
2015-01-01 09:02:00    3  London         11.0                    11.0
2015-01-01 09:03:00    3  London         10.0                    10.0
2015-01-01 09:04:00    3  London          9.0                     9.0

In [39]:
# chap:4

In [40]:
# Statistical Methods

In [41]:
import pandas as pd
omh=pd.read_csv('omh.csv')
omh

          Date   MSFT    AAPL
0   2014-12-01  48.62  115.07
1   2014-12-02  48.46  114.63
2   2014-12-03  48.08  115.93
3   2014-12-04  48.84  115.49
4   2014-12-05  48.42  115.00
5   2014-12-08  47.70  112.40
6   2014-12-09  47.59  114.12
7   2014-12-10  46.90  111.95
8   2014-12-11  47.17  111.62
9   2014-12-12  46.95  109.73
10  2014-12-15  46.67  108.23
11  2014-12-16  45.16  106.75
12  2014-12-17  45.74  109.41
13  2014-12-18  47.52  112.65
14  2014-12-19  47.66  111.78
15  2014-12-22  47.98  112.94
16  2014-12-23  48.45  112.54
17  2014-12-24  48.14  112.01
18  2014-12-26  47.88  113.99
19  2014-12-29  47.45  113.91
20  2014-12-30  47.02  112.52
21  2014-12-31  46.45  110.38

In [43]:
omh[['MSFT','AAPL']].min()

MSFT     45.16
AAPL    106.75
dtype: float64

In [44]:
omh[['MSFT','AAPL']].max()

MSFT     48.84
AAPL    115.93
dtype: float64

In [46]:
omh[['MSFT','AAPL']].idxmin()

MSFT    11
AAPL    11
dtype: int64

In [47]:
omh[['MSFT','AAPL']].idxmax()

MSFT    3
AAPL    2
dtype: int64

In [49]:
omh.nlargest(4,['MSFT'])['MSFT']

3     48.84
0     48.62
1     48.46
16    48.45
Name: MSFT, dtype: float64

In [52]:
omh.nsmallest(4,['MSFT'])['MSFT']

11    45.16
12    45.74
21    46.45
10    46.67
Name: MSFT, dtype: float64

In [54]:
omh.describe()

            MSFT        AAPL
count  22.000000   22.000000
mean   47.493182  112.411364
std     0.933077    2.388772
min    45.160000  106.750000
25%    46.967500  111.660000
50%    47.625000  112.530000
75%    48.125000  114.087500
max    48.840000  115.930000

In [56]:
omh['MSFT'].describe()['mean']

47.49318181818182

In [57]:
s=omh['MSFT']
s.describe()

count    22.000000
mean     47.493182
std       0.933077
min      45.160000
25%      46.967500
50%      47.625000
75%      48.125000
max      48.840000
Name: MSFT, dtype: float64

In [58]:
omh.mean()

MSFT     47.493182
AAPL    112.411364
dtype: float64

In [60]:
omh.head()

         Date   MSFT    AAPL
0  2014-12-01  48.62  115.07
1  2014-12-02  48.46  114.63
2  2014-12-03  48.08  115.93
3  2014-12-04  48.84  115.49
4  2014-12-05  48.42  115.00

In [59]:
omh.mean(axis=1)

0     81.845
1     81.545
2     82.005
3     82.165
4     81.710
5     80.050
6     80.855
7     79.425
8     79.395
9     78.340
10    77.450
11    75.955
12    77.575
13    80.085
14    79.720
15    80.460
16    80.495
17    80.075
18    80.935
19    80.680
20    79.770
21    78.415
dtype: float64

In [61]:
omh.median()

MSFT     47.625
AAPL    112.530
dtype: float64

In [63]:
omh.var()

MSFT    0.870632
AAPL    5.706231
dtype: float64

In [ ]:
omh.std()

In [66]:
omh['MSFT'].cov(omh['AAPL'])

1.9261240259740264

In [67]:
omh['MSFT'].corr(omh['AAPL'])

0.8641560684381171

In [69]:
#

In [70]:
omh.head()

         Date   MSFT    AAPL
0  2014-12-01  48.62  115.07
1  2014-12-02  48.46  114.63
2  2014-12-03  48.08  115.93
3  2014-12-04  48.84  115.49
4  2014-12-05  48.42  115.00

In [71]:
df.head()

                     num    city  rolling_sum  rolling_sum_backfilled
date
2015-01-01 09:00:00    4  London          NaN                    11.0
2015-01-01 09:01:00    4  London          NaN                    11.0
2015-01-01 09:02:00    3  London         11.0                    11.0
2015-01-01 09:03:00    3  London         10.0                    10.0
2015-01-01 09:04:00    3  London          9.0                     9.0

In [76]:
df=pd.read_csv('sp500.csv')
df.set_index('Symbol',inplace=True)

In [77]:
df.index.get_loc('ABT')

1

In [78]:
df.head()

,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
Symbol,,,,,,,,,,,,,,
MMM,3M Co.,Industrials,141.14,2.12,20.33,6.900,26.668,107.15,143.37,92.345,8.121,2.95,5.26,http://www.sec.gov/cgi-bin/browse-edgar?action...
ABT,Abbott Laboratories,Health Care,39.60,1.82,25.93,1.529,15.573,32.70,40.49,59.477,4.359,2.74,2.55,http://www.sec.gov/cgi-bin/browse-edgar?action...
ABBV,AbbVie Inc.,Health Care,53.95,3.02,20.87,2.570,2.954,40.10,54.78,85.784,7.190,4.48,18.16,http://www.sec.gov/cgi-bin/browse-edgar?action...
ACN,Accenture,Information Technology,79.79,2.34,19.53,4.068,8.326,69.00,85.88,50.513,4.423,1.75,9.54,http://www.sec.gov/cgi-bin/browse-edgar?action...
ACE,ACE Limited,Financials,102.91,2.21,10.00,10.293,86.897,84.73,104.07,34.753,4.275,1.79,1.18,http://www.sec.gov/cgi-bin/browse-edgar?action...

In [81]:
# linspace
import numpy as np

In [82]:
np.linspace(0,10,2)

array([ 0., 10.])

In [84]:
s=pd.Series(np.linspace(0,10,5))

In [85]:
s

0     0.0
1     2.5
2     5.0
3     7.5
4    10.0
dtype: float64

In [86]:
s1=s.reindex([2,4])

In [87]:
s1

2     5.0
4    10.0
dtype: float64

In [88]:
df.head()

,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
Symbol,,,,,,,,,,,,,,
MMM,3M Co.,Industrials,141.14,2.12,20.33,6.900,26.668,107.15,143.37,92.345,8.121,2.95,5.26,http://www.sec.gov/cgi-bin/browse-edgar?action...
ABT,Abbott Laboratories,Health Care,39.60,1.82,25.93,1.529,15.573,32.70,40.49,59.477,4.359,2.74,2.55,http://www.sec.gov/cgi-bin/browse-edgar?action...
ABBV,AbbVie Inc.,Health Care,53.95,3.02,20.87,2.570,2.954,40.10,54.78,85.784,7.190,4.48,18.16,http://www.sec.gov/cgi-bin/browse-edgar?action...
ACN,Accenture,Information Technology,79.79,2.34,19.53,4.068,8.326,69.00,85.88,50.513,4.423,1.75,9.54,http://www.sec.gov/cgi-bin/browse-edgar?action...
ACE,ACE Limited,Financials,102.91,2.21,10.00,10.293,86.897,84.73,104.07,34.753,4.275,1.79,1.18,http://www.sec.gov/cgi-bin/browse-edgar?action...

In [103]:
df1=df['Price'].reset_index().head(10)

In [104]:
df1

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95
3    ACN   79.79
4    ACE  102.91
5    ACT  213.77
6   ADBE   64.30
7    AES   13.61
8    AET   76.39
9    AFL   61.31

In [105]:
df2=df1.reindex([0,1,2])

In [106]:
df2

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95

In [110]:
df1

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95
3    ACN   79.79
4    ACE  102.91
5    ACT  213.77
6   ADBE   64.30
7    AES   13.61
8    AET   76.39
9    AFL   61.31

In [112]:
df1.iat[2,1]

53.95

In [114]:
df1.at[2,'Price']

53.95

In [115]:
df5=df1.copy()

In [116]:
df5

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95
3    ACN   79.79
4    ACE  102.91
5    ACT  213.77
6   ADBE   64.30
7    AES   13.61
8    AET   76.39
9    AFL   61.31

In [121]:
df5.drop([0,4],inplace=True)

In [122]:
df5

  Symbol   Price
1    ABT   39.60
2   ABBV   53.95
3    ACN   79.79
5    ACT  213.77
6   ADBE   64.30
7    AES   13.61
8    AET   76.39
9    AFL   61.31

In [123]:
df5=df1.copy()

In [126]:
df5.drop(,[1])

SyntaxError: invalid syntax (<ipython-input-126-0f7d3d281f92>, line 1)

In [127]:
df5

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95
3    ACN   79.79
4    ACE  102.91
5    ACT  213.77
6   ADBE   64.30
7    AES   13.61
8    AET   76.39
9    AFL   61.31

In [129]:
df5.loc[10]=['XXX',60.9]

In [131]:
df5

   Symbol   Price
0     MMM  141.14
1     ABT   39.60
2    ABBV   53.95
3     ACN   79.79
4     ACE  102.91
5     ACT  213.77
6    ADBE   64.30
7     AES   13.61
8     AET   76.39
9     AFL   61.31
10    XXX   60.90

In [132]:
df6=df5[0:3]
df7=df5[6:9]

In [133]:
df8=df6.append(df7)

In [134]:
df8

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95
6   ADBE   64.30
7    AES   13.61
8    AET   76.39

In [136]:
df8.pop('Price')

0    141.14
1     39.60
2     53.95
6     64.30
7     13.61
8     76.39
Name: Price, dtype: float64

In [137]:
df8

  Symbol
0    MMM
1    ABT
2   ABBV
6   ADBE
7    AES
8    AET

In [139]:
df2

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95

In [141]:
df2.drop('Price',axis=1)

  Symbol
0    MMM
1    ABT
2   ABBV

In [142]:
df2

  Symbol   Price
0    MMM  141.14
1    ABT   39.60
2   ABBV   53.95

In [143]:
df2.pop('Price')

0    141.14
1     39.60
2     53.95
Name: Price, dtype: float64

In [144]:
df2

  Symbol
0    MMM
1    ABT
2   ABBV

In [145]:
#

In [154]:
sp_500=pd.read_csv('sp500.csv',usecols=['Symbol','Sector','Price','Book Value'])
sp_500.head()

  Symbol                  Sector   Price  Book Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

In [156]:
copy=sp_500.copy()

In [159]:
copy['Price']=copy['Price'].round(1)

In [161]:
copy.head()

  Symbol                  Sector  Price  Book Value
0    MMM             Industrials  141.1      26.668
1    ABT             Health Care   39.6      15.573
2   ABBV             Health Care   54.0       2.954
3    ACN  Information Technology   79.8       8.326
4    ACE              Financials  102.9      86.897

In [162]:
new_copy=copy.columns[::-1]

In [163]:
new_copy

Index(['Book Value', 'Price', 'Sector', 'Symbol'], dtype='object')

In [164]:
sp_500[new_copy]

     Book Value   Price                  Sector Symbol
0        26.668  141.14             Industrials    MMM
1        15.573   39.60             Health Care    ABT
2         2.954   53.95             Health Care   ABBV
3         8.326   79.79  Information Technology    ACN
4        86.897  102.91              Financials    ACE
..          ...     ...                     ...    ...
495      12.768   35.02  Information Technology   YHOO
496       5.147   74.77  Consumer Discretionary    YUM
497      37.181  101.84             Health Care    ZMH
498      30.191   28.43              Financials   ZION
499       2.150   30.53             Health Care    ZTS

[500 rows x 4 columns]

In [165]:
sp_500.head()

  Symbol                  Sector   Price  Book Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

In [169]:
sp_500.rename(columns={'Book Value':'Book_Value'},inplace=True)

In [170]:
sp_500.head()

  Symbol                  Sector   Price  Book_Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

In [173]:
rounded_price=pd.DataFrame({'RoundedPrice':sp_500['Price'].round()})

In [175]:
rounded_price.head()

   RoundedPrice
0         141.0
1          40.0
2          54.0
3          80.0
4         103.0

In [176]:
sp_500.head()

  Symbol                  Sector   Price  Book_Value
0    MMM             Industrials  141.14      26.668
1    ABT             Health Care   39.60      15.573
2   ABBV             Health Care   53.95       2.954
3    ACN  Information Technology   79.79       8.326
4    ACE              Financials  102.91      86.897

In [177]:
concat=pd.concat([sp_500,rounded_price],axis=1)

In [178]:
concat

    Symbol                  Sector   Price  Book_Value  RoundedPrice
0      MMM             Industrials  141.14      26.668         141.0
1      ABT             Health Care   39.60      15.573          40.0
2     ABBV             Health Care   53.95       2.954          54.0
3      ACN  Information Technology   79.79       8.326          80.0
4      ACE              Financials  102.91      86.897         103.0
..     ...                     ...     ...         ...           ...
495   YHOO  Information Technology   35.02      12.768          35.0
496    YUM  Consumer Discretionary   74.77       5.147          75.0
497    ZMH             Health Care  101.84      37.181         102.0
498   ZION              Financials   28.43      30.191          28.0
499    ZTS             Health Care   30.53       2.150          31.0

[500 rows x 5 columns]

In [179]:
# Transforming data

In [180]:
import pandas as pd

In [181]:
s=pd.Series([0,1.0,2.0,3.0,4.0])

In [182]:
s

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [183]:
s.replace(0.0,99)

0    99.0
1     1.0
2     2.0
3     3.0
4     4.0
dtype: float64

In [184]:
s

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [186]:
s.replace([0,1,2,3,4],[100,101,102,103,104])

0    100.0
1    101.0
2    102.0
3    103.0
4    104.0
dtype: float64

In [188]:
s.replace({0:100,1:101})

0    100.0
1    101.0
2      2.0
3      3.0
4      4.0
dtype: float64

In [189]:
s=pd.Series(np.arange(0,5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [192]:
s.apply(lambda v:v*2)

0    0
1    2
2    4
3    6
4    8
dtype: int64

In [193]:
df=pd.DataFrame(np.arange(12).reshape(4,3),columns=['a','b','c'])

In [194]:
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [198]:
df.apply(lambda x:print(x))

0    0
1    3
2    6
3    9
Name: a, dtype: int32
0     1
1     4
2     7
3    10
Name: b, dtype: int32
0     2
1     5
2     8
3    11
Name: c, dtype: int32

a    None
b    None
c    None
dtype: object

In [199]:
df.apply(lambda x:type(x))

a    <class 'pandas.core.series.Series'>
b    <class 'pandas.core.series.Series'>
c    <class 'pandas.core.series.Series'>
dtype: object

In [196]:
df.apply(lambda x:x.sum())

a    18
b    22
c    26
dtype: int64

In [200]:
df.apply(lambda x:x*2)

    a   b   c
0   0   2   4
1   6   8  10
2  12  14  16
3  18  20  22

In [201]:
df.apply(lambda col:col.sum())

a    18
b    22
c    26
dtype: int64

In [202]:
df.apply(lambda row:row.sum(),axis=1)

0     3
1    12
2    21
3    30
dtype: int64

In [203]:
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [207]:
df['interim']=df.apply(lambda r:r['a']*r['b'],axis=1)

In [208]:
df

   a   b   c  interim
0  0   1   2        0
1  3   4   5       12
2  6   7   8       42
3  9  10  11       90

In [209]:
df['result']=df.apply(lambda r:r['interim']+r['c'],axis=1)

In [210]:
df

   a   b   c  interim  result
0  0   1   2        0       2
1  3   4   5       12      17
2  6   7   8       42      50
3  9  10  11       90     101

In [211]:
df=pd.DataFrame(np.arange(0,15).reshape(3,5))

In [212]:
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [213]:
df.loc[1,2]=np.nan

In [214]:
df

    0   1     2   3   4
0   0   1   2.0   3   4
1   5   6   NaN   8   9
2  10  11  12.0  13  14

In [216]:
df.apply(lambda row:row.sum(),axis=1)

0    10.0
1    28.0
2    60.0
dtype: float64

In [218]:
df.dropna().apply(lambda x:x.sum(),axis=1)

0    10.0
2    60.0
dtype: float64

In [219]:
df

    0   1     2   3   4
0   0   1   2.0   3   4
1   5   6   NaN   8   9
2  10  11  12.0  13  14

In [220]:
df.loc[1,2]=9

In [221]:
df

    0   1     2   3   4
0   0   1   2.0   3   4
1   5   6   9.0   8   9
2  10  11  12.0  13  14

In [ ]:
df.applymap(lambda x:x*2)

In [229]:
#

In [230]:
omh.head()

         Date   MSFT    AAPL
0  2014-12-01  48.62  115.07
1  2014-12-02  48.46  114.63
2  2014-12-03  48.08  115.93
3  2014-12-04  48.84  115.49
4  2014-12-05  48.42  115.00

In [232]:
omh['MSFT'].pct_change()

0          NaN
1    -0.003291
2    -0.007842
3     0.015807
4    -0.008600
5    -0.014870
6    -0.002306
7    -0.014499
8     0.005757
9    -0.004664
10   -0.005964
11   -0.032355
12    0.012843
13    0.038916
14    0.002946
15    0.006714
16    0.009796
17   -0.006398
18   -0.005401
19   -0.008981
20   -0.009062
21   -0.012123
Name: MSFT, dtype: float64

In [233]:
#

In [234]:
df=pd.read_csv('sp500.csv')
df.set_index('Symbol',inplace=True)
df.head()

,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
Symbol,,,,,,,,,,,,,,
MMM,3M Co.,Industrials,141.14,2.12,20.33,6.900,26.668,107.15,143.37,92.345,8.121,2.95,5.26,http://www.sec.gov/cgi-bin/browse-edgar?action...
ABT,Abbott Laboratories,Health Care,39.60,1.82,25.93,1.529,15.573,32.70,40.49,59.477,4.359,2.74,2.55,http://www.sec.gov/cgi-bin/browse-edgar?action...
ABBV,AbbVie Inc.,Health Care,53.95,3.02,20.87,2.570,2.954,40.10,54.78,85.784,7.190,4.48,18.16,http://www.sec.gov/cgi-bin/browse-edgar?action...
ACN,Accenture,Information Technology,79.79,2.34,19.53,4.068,8.326,69.00,85.88,50.513,4.423,1.75,9.54,http://www.sec.gov/cgi-bin/browse-edgar?action...
ACE,ACE Limited,Financials,102.91,2.21,10.00,10.293,86.897,84.73,104.07,34.753,4.275,1.79,1.18,http://www.sec.gov/cgi-bin/browse-edgar?action...

In [240]:
df.nlargest(10,'Market Cap')

,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
Symbol,,,,,,,,,,,,,,
AAPL,Apple Inc.,Information Technology,614.13,2.05,14.55,41.727,139.460,388.87,614.73,529.0,57.795,2.97,4.35,http://www.sec.gov/cgi-bin/browse-edgar?action...
XOM,Exxon Mobil Corp.,Energy,101.32,2.54,13.82,7.342,41.077,84.79,103.45,435.1,60.657,1.11,2.47,http://www.sec.gov/cgi-bin/browse-edgar?action...
GOOG,Google Inc.,Information Technology,552.70,NaN,28.56,19.085,135.977,502.80,604.83,372.8,18.582,5.90,4.01,http://www.sec.gov/cgi-bin/browse-edgar?action...
MSFT,Microsoft Corp.,Information Technology,40.12,2.67,15.02,2.669,10.584,30.84,41.66,331.4,32.127,3.97,3.79,http://www.sec.gov/cgi-bin/browse-edgar?action...
JNJ,Johnson & Johnson,Health Care,100.98,2.65,19.31,5.228,27.083,82.12,101.98,285.7,23.640,3.97,3.73,http://www.sec.gov/cgi-bin/browse-edgar?action...
GE,General Electric,Industrials,26.51,3.09,21.80,1.216,13.147,22.76,28.09,265.8,28.211,1.83,2.02,http://www.sec.gov/cgi-bin/browse-edgar?action...
WFC,Wells Fargo,Financials,50.16,2.50,12.44,4.020,30.479,39.40,50.49,264.2,0.000,3.22,1.64,http://www.sec.gov/cgi-bin/browse-edgar?action...
WMT,Wal-Mart Stores,Consumer Staples,75.61,2.52,15.57,4.843,22.607,71.51,81.37,244.4,35.560,0.51,3.33,http://www.sec.gov/cgi-bin/browse-edgar?action...
CVX,Chevron Corp.,Energy,123.37,3.29,12.04,10.269,79.143,109.27,127.83,234.9,39.906,1.13,1.56,http://www.sec.gov/cgi-bin/browse-edgar?action...
PG,Procter & Gamble,Consumer Staples,80.52,3.04,21.50,3.751,25.191,73.61,85.82,217.9,19.683,2.58,3.20,http://www.sec.gov/cgi-bin/browse-edgar?action...

In [241]:
df.nlargest(10,'Market Cap')['Sector'].value_counts()

Information Technology    3
Consumer Staples          2
Energy                    2
Health Care               1
Industrials               1
Financials                1
Name: Sector, dtype: int64

In [242]:
df.nlargest(10,'Price/Earnings')

,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
Symbol,,,,,,,,,,,,,,
EA,Electronic Arts,Information Technology,34.88,NaN,1329.62,0.026,7.777,20.47,35.65,10.971,0.2470,3.04,4.45,http://www.sec.gov/cgi-bin/browse-edgar?action...
AMZN,Amazon.com Inc,Consumer Discretionary,312.24,NaN,475.68,0.641,22.452,258.34,408.06,143.700,3.7900,1.80,13.58,http://www.sec.gov/cgi-bin/browse-edgar?action...
PLD,ProLogis,Financials,41.02,2.89,409.09,0.099,26.961,34.60,43.16,20.497,1.0500,11.20,1.50,http://www.sec.gov/cgi-bin/browse-edgar?action...
SBUX,Starbucks Corp.,Consumer Discretionary,71.98,1.39,364.29,0.196,6.558,62.31,82.50,54.186,3.1680,3.43,10.89,http://www.sec.gov/cgi-bin/browse-edgar?action...
HCN,Health Care REIT,Financials,64.51,4.90,254.56,0.250,35.344,52.43,74.77,18.802,1.6560,6.08,1.80,http://www.sec.gov/cgi-bin/browse-edgar?action...
FRX,Forest Laboratories,Health Care,95.57,NaN,155.92,0.610,22.202,38.39,100.88,25.896,0.3974,7.07,4.28,http://www.sec.gov/cgi-bin/browse-edgar?action...
CCI,Crown Castle International Corp.,Telecommunications Services,76.00,0.46,154.32,0.495,20.836,66.73,78.00,25.235,1.8200,8.03,3.67,http://www.sec.gov/cgi-bin/browse-edgar?action...
NFLX,NetFlix Inc.,Information Technology,402.35,NaN,147.24,2.661,24.664,205.75,458.00,24.117,0.3428,5.08,15.89,http://www.sec.gov/cgi-bin/browse-edgar?action...
WM,Waste Management Inc.,Industrials,43.37,3.38,128.64,0.338,12.330,38.81,46.38,20.183,3.4550,1.44,3.53,http://www.sec.gov/cgi-bin/browse-edgar?action...
ADBE,Adobe Systems Inc,Information Technology,64.30,NaN,121.44,0.520,13.262,41.91,71.11,32.004,0.7525,7.77,4.76,http://www.sec.gov/cgi-bin/browse-edgar?action...

In [243]:
df.nlargest(10,'Price')

,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
Symbol,,,,,,,,,,,,,,
PCLN,Priceline.com Inc,Industrials,1197.12,NaN,31.44,37.471,137.886,787.00,1378.96,62.767,2.6990,8.66,8.54,http://www.sec.gov/cgi-bin/browse-edgar?action...
GHC,Graham Holdings Co,Consumer Discretionary,677.29,0.76,NaN,0.000,0.000,456.66,745.11,NaN,0.0000,NaN,NaN,http://www.sec.gov/cgi-bin/browse-edgar?action...
AAPL,Apple Inc.,Information Technology,614.13,2.05,14.55,41.727,139.460,388.87,614.73,529.000,57.7950,2.97,4.35,http://www.sec.gov/cgi-bin/browse-edgar?action...
GOOG,Google Inc.,Information Technology,552.70,NaN,28.56,19.085,135.977,502.80,604.83,372.800,18.5820,5.90,4.01,http://www.sec.gov/cgi-bin/browse-edgar?action...
AZO,AutoZone Inc,Consumer Discretionary,540.90,NaN,18.19,29.777,-51.275,404.87,561.62,17.972,2.0540,1.92,NaN,http://www.sec.gov/cgi-bin/browse-edgar?action...
CMG,Chipotle Mexican Grill,Consumer Discretionary,522.32,NaN,48.83,10.659,52.915,350.66,622.90,16.235,0.6542,4.77,9.84,http://www.sec.gov/cgi-bin/browse-edgar?action...
NFLX,NetFlix Inc.,Information Technology,402.35,NaN,147.24,2.661,24.664,205.75,458.00,24.117,0.3428,5.08,15.89,http://www.sec.gov/cgi-bin/browse-edgar?action...
ISRG,Intuitive Surgical Inc.,Health Care,363.86,NaN,27.39,13.315,95.224,346.46,541.23,13.973,0.7971,6.61,3.83,http://www.sec.gov/cgi-bin/browse-edgar?action...
AMZN,Amazon.com Inc,Consumer Discretionary,312.24,NaN,475.68,0.641,22.452,258.34,408.06,143.700,3.7900,1.80,13.58,http://www.sec.gov/cgi-bin/browse-edgar?action...
BLK,BlackRock,Financials,300.69,2.32,17.03,17.653,156.547,240.60,326.00,50.858,4.4580,4.89,1.92,http://www.sec.gov/cgi-bin/browse-edgar?action...

In [244]:
#

In [245]:
df=pd.DataFrame(np.arange(0,15).reshape(5,3),index=['a','b','c','d','e'],columns=['c1','c2','c3'])
df

   c1  c2  c3
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

In [246]:
df['c4']=np.nan

In [247]:
df

   c1  c2  c3  c4
a   0   1   2 NaN
b   3   4   5 NaN
c   6   7   8 NaN
d   9  10  11 NaN
e  12  13  14 NaN

In [248]:
df.loc['f']=np.arange(15,19)

In [249]:
df.loc['g']=np.nan

In [250]:
df['c5']=np.nan

In [251]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0   NaN NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [252]:
df['c4']['a']=20

In [253]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [254]:
df.isnull()

      c1     c2     c3     c4    c5
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False   True  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [255]:
df.isnull().sum()

c1    1
c2    1
c3    1
c4    5
c5    7
dtype: int64

In [257]:
df.isnull().sum().sum()

15

In [258]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [259]:
df.count()

c1    6
c2    6
c3    6
c4    2
c5    0
dtype: int64

In [262]:
len(df)

7

In [263]:
df.notnull()

      c1     c2     c3     c4     c5
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

In [264]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [269]:
df[~df['c4'].isnull()]['c4']

a    20.0
f    18.0
Name: c4, dtype: float64

In [270]:
df['c4'].notnull()

a     True
b    False
c    False
d    False
e    False
f     True
g    False
Name: c4, dtype: bool

In [272]:
df[df['c4'].notnull()]['c4']

a    20.0
f    18.0
Name: c4, dtype: float64

In [273]:
df['c4'].dropna()

a    20.0
f    18.0
Name: c4, dtype: float64

In [274]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [275]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

In [276]:
df.dropna(how='all')

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN

In [277]:
df.dropna(how='all',axis=1)

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

In [278]:
df2=df.copy()

In [279]:
df2.loc['g','c1']=0

In [280]:
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   NaN   NaN NaN

In [281]:
df2.loc['g','c3']=0

In [282]:
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [283]:
df2.dropna(how='any',axis=1)

     c1    c3
a   0.0   2.0
b   3.0   5.0
c   6.0   8.0
d   9.0  11.0
e  12.0  14.0
f  15.0  17.0
g   0.0   0.0

In [284]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [285]:
df.dropna(thresh=5,axis=1)

     c1    c2    c3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f  15.0  16.0  17.0
g   NaN   NaN   NaN

In [289]:
df.dropna(thresh=2,axis=1)

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

In [290]:
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

In [292]:
filled=df.fillna(0)

In [293]:
filled

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0   0.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [294]:
#

In [300]:
df=pd.read_csv('flights.csv')
df.head()

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0
3,2018-01-01,B6,DTW,BOS,600,754,0,79.0,632.0,0,0,19,0,0
4,2018-01-01,UA,LAS,EWR,600,1348,0,261.0,2227.0,0,0,0,0,0

In [301]:
grp_airline=df.groupby('airline')

In [303]:
grp_airline.ngroups

16

In [304]:
len(df['airline'].value_counts())

16

In [305]:
grp_airline.groups

{'9E': Int64Index([   84,    91,   126,   170,   186,   213,   560,   719,   735,
               770,
             ...
             65209, 65319, 65340, 65449, 65477, 65480, 65560, 65690, 65714,
             65851],
            dtype='int64', length=1037),
 'AA': Int64Index([   10,    11,    14,    37,    41,    42,    45,    46,    50,
                52,
             ...
             65886, 65887, 65890, 65894, 65898, 65902, 65907, 65911, 65913,
             65914],
            dtype='int64', length=16779),
 'AS': Int64Index([    8,    66,   145,   164,   246,   295,   319,   322,   324,
               406,
             ...
             65786, 65816, 65840, 65854, 65860, 65891, 65897, 65900, 65917,
             65922],
            dtype='int64', length=3244),
 'B6': Int64Index([    2,     3,     7,    17,    48,    65,    74,   115,   132,
               179,
             ...
             65738, 65770, 65772, 65792, 65825, 65885, 65901, 65915, 65919,
             65920],
            dtype='int64', length=3816),
 'DL': Int64Index([   16,    26,    28,    31,    32,    54,    56,    59,    70,
                72,
             ...
             65837, 65847, 65862, 65864, 65867, 65873, 65878, 65884, 65908,
             65910],
            dtype='int64', length=13104),
 'EV': Int64Index([  269,   720,  1363,  1626,  1635,  1684,  1709,  1855,  1903,
              2320,
             ...
             60748, 60975, 61086, 61934, 63096, 63342, 63640, 63858, 65470,
             65512],
            dtype='int64', length=171),
 'F9': Int64Index([   12,   133,   134,   160,   178,   302,   356,   389,   460,
               479,
             ...
             65250, 65336, 65358, 65395, 65558, 65563, 65566, 65765, 65799,
             65912],
            dtype='int64', length=1141),
 'MQ': Int64Index([  370,   922,  1069,  1203,  1232,  1288,  1439,  1455,  1580,
              1593,
             ...
             64331, 64505, 64800, 64925, 65109, 65254, 65592, 65744, 65841,
             65868],
            dtype='int64', length=373),
 'NK': Int64Index([   29,    40,    64,    71,   131,   141,   156,   168,   169,
               184,
             ...
             65821, 65826, 65838, 65865, 65866, 65877, 65883, 65888, 65899,
             65916],
            dtype='int64', length=2764),
 'OH': Int64Index([   57,    82,   291,   881,   957,  1108,  1624,  1628,  1825,
              1926,
             ...
             63465, 63477, 63512, 63768, 63826, 64490, 64753, 65016, 65219,
             65421],
            dtype='int64', length=257),
 'OO': Int64Index([   13,    23,    27,   111,   204,   223,   279,   283,   315,
               339,
             ...
             65456, 65526, 65537, 65543, 65550, 65648, 65688, 65709, 65796,
             65889],
            dtype='int64', length=2085),
 'UA': Int64Index([    0,     4,     6,     9,    18,    20,    22,    24,    33,
                35,
             ...
             65871, 65872, 65875, 65876, 65892, 65893, 65896, 65904, 65905,
             65921],
            dtype='int64', length=11882),
 'VX': Int64Index([   51,    63,   104,   138,   261,   309,   325,   344,   347,
               357,
             ...
             15147, 15160, 15225, 15243, 15260, 15275, 15302, 15386, 15402,
             15412],
            dtype='int64', length=429),
 'WN': Int64Index([    1,     5,    19,    25,    30,    34,    36,    39,    49,
                76,
             ...
             65829, 65831, 65844, 65848, 65858, 65874, 65895, 65906, 65909,
             65918],
            dtype='int64', length=4912),
 'YV': Int64Index([   68,    69,   193,   194,   230,   310,   409,   432,   465,
               545,
             ...
             65344, 65423, 65471, 65509, 65545, 65728, 65736, 65785, 65808,
             65853],
            dtype='int64', length=729),
 'YX': Int64Index([   15,    21,    55,    92,   129,   137,   175,   181,   183,
               185,
             ...
             65661, 65703, 65713, 65721, 65737, 65795, 65815, 65869, 65879,
             65903],
            dtype='int64', length=3200)}

In [306]:
grp_airline.size()

airline
9E     1037
AA    16779
AS     3244
B6     3816
DL    13104
EV      171
F9     1141
MQ      373
NK     2764
OH      257
OO     2085
UA    11882
VX      429
WN     4912
YV      729
YX     3200
dtype: int64

In [307]:
df['airline'].value_counts()

AA    16779
DL    13104
UA    11882
WN     4912
B6     3816
AS     3244
YX     3200
NK     2764
OO     2085
F9     1141
9E     1037
YV      729
VX      429
MQ      373
OH      257
EV      171
Name: airline, dtype: int64

In [308]:
grp_airline.count()

,date,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
airline,,,,,,,,,,,,,
9E,1037,1037,1037,1037,1037,1037,997,1037,1037,1037,1037,1037,1037
AA,16779,16779,16779,16779,16779,16779,16438,16779,16779,16779,16779,16779,16779
AS,3244,3244,3244,3244,3244,3244,3193,3244,3244,3244,3244,3244,3244
B6,3816,3816,3816,3816,3816,3816,3719,3816,3816,3816,3816,3816,3816
DL,13104,13104,13104,13104,13104,13104,12998,13104,13104,13104,13104,13104,13104
EV,171,171,171,171,171,171,159,171,171,171,171,171,171
F9,1141,1141,1141,1141,1141,1141,1127,1141,1141,1141,1141,1141,1141
MQ,373,373,373,373,373,373,353,373,373,373,373,373,373
NK,2764,2764,2764,2764,2764,2764,2720,2764,2764,2764,2764,2764,2764
OH,257,257,257,257,257,257,246,257,257,257,257,257,257
OO,2085,2085,2085,2085,2085,2085,2039,2085,2085,2085,2085,2085,2085
UA,11882,11882,11882,11882,11882,11882,11720,11882,11882,11882,11882,11882,11882
VX,429,429,429,429,429,429,407,429,429,429,429,429,429
WN,4912,4912,4912,4912,4912,4912,4821,4912,4912,4912,4912,4912,4912
YV,729,729,729,729,729,729,715,729,729,729,729,729,729
YX,3200,3200,3200,3200,3200,3200,3049,3200,3200,3200,3200,3200,3200

In [310]:
grp_airline.get_group('WN').head()

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
5,2018-01-01,WN,PHX,DEN,600,740,0,78.0,602.0,0,0,0,0,0
19,2018-01-01,WN,PHX,LAS,725,730,0,43.0,255.0,0,0,0,0,0
25,2018-01-01,WN,SEA,PHX,755,1150,0,134.0,1107.0,0,0,0,0,0
30,2018-01-01,WN,DEN,LAS,825,925,0,89.0,628.0,27,0,0,0,0

In [312]:
grp_airline.head(3).sort_values(by='airline')

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
84,2018-01-01,9E,IAH,ATL,1346,1651,0,86.0,689.0,0,0,0,0,0
91,2018-01-01,9E,IAH,DTW,1518,1909,0,132.0,1075.0,0,0,0,0,45
126,2018-01-01,9E,JFK,DTW,1845,2112,0,89.0,509.0,0,0,0,0,0
10,2018-01-01,AA,DFW,DCA,610,959,0,131.0,1192.0,0,0,0,0,0
11,2018-01-01,AA,EWR,CLT,630,835,0,95.0,529.0,100,0,0,0,0
14,2018-01-01,AA,DCA,DFW,659,945,0,185.0,1192.0,0,0,0,0,0
145,2018-01-01,AS,SEA,PHX,2055,37,0,136.0,1107.0,0,0,0,0,0
66,2018-01-01,AS,SEA,SFO,1155,1413,0,101.0,679.0,0,0,0,0,0
8,2018-01-01,AS,SEA,SFO,605,816,0,97.0,679.0,0,0,0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0
3,2018-01-01,B6,DTW,BOS,600,754,0,79.0,632.0,0,0,19,0,0
7,2018-01-01,B6,DCA,BOS,600,724,0,58.0,399.0,0,0,0,0,0
28,2018-01-01,DL,JFK,SFO,805,1207,0,365.0,2586.0,0,0,0,0,0
26,2018-01-01,DL,LGA,ATL,759,1034,0,123.0,762.0,0,0,0,0,0
16,2018-01-01,DL,LGA,MCO,700,953,0,155.0,950.0,0,0,0,0,0
1363,2018-01-09,EV,DCA,EWR,600,720,0,38.0,199.0,0,0,0,0,0
269,2018-01-02,EV,EWR,DCA,1500,1623,0,44.0,199.0,0,0,0,0,0
720,2018-01-05,EV,CLT,LGA,925,1131,1,NaN,544.0,0,0,0,0,0
133,2018-01-01,F9,LAS,DEN,1940,2238,0,83.0,628.0,0,0,0,0,0
12,2018-01-01,F9,DEN,LAS,650,755,0,93.0,628.0,17,0,1,0,0
134,2018-01-01,F9,DEN,IAH,1959,2319,0,102.0,862.0,0,0,0,0,0
1069,2018-01-07,MQ,DTW,LGA,1404,1548,0,75.0,502.0,0,0,0,0,0
370,2018-01-03,MQ,DTW,LGA,859,1050,0,80.0,502.0,0,0,0,0,0
922,2018-01-06,MQ,ORD,DCA,1330,1621,0,85.0,612.0,0,0,0,0,0
64,2018-01-01,NK,LAS,PHL,1150,1924,0,241.0,2176.0,0,0,0,0,0
40,2018-01-01,NK,MCO,EWR,1000,1238,0,125.0,937.0,0,0,0,0,0
29,2018-01-01,NK,DFW,LGA,806,1226,0,163.0,1389.0,0,0,0,0,0
57,2018-01-01,OH,CLT,DCA,1130,1254,0,55.0,331.0,0,0,0,0,0
291,2018-01-02,OH,DTW,CLT,1651,1856,0,80.0,500.0,0,0,0,0,0
82,2018-01-01,OH,ATL,CLT,1345,1503,0,42.0,226.0,0,0,0,0,0
13,2018-01-01,OO,SFO,LAX,650,825,0,56.0,337.0,0,0,0,0,0
27,2018-01-01,OO,SFO,MSP,800,1401,0,200.0,1589.0,0,0,0,0,0
23,2018-01-01,OO,DFW,SFO,750,1005,0,216.0,1464.0,0,0,0,0,0
4,2018-01-01,UA,LAS,EWR,600,1348,0,261.0,2227.0,0,0,0,0,0
6,2018-01-01,UA,BOS,ORD,600,755,0,132.0,867.0,0,0,0,0,0
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
51,2018-01-01,VX,EWR,SFO,1100,1435,0,353.0,2565.0,0,0,0,0,0
63,2018-01-01,VX,JFK,SFO,1150,1519,0,352.0,2586.0,0,0,0,0,0
104,2018-01-01,VX,JFK,SFO,1635,2022,0,341.0,2586.0,0,0,0,0,0
19,2018-01-01,WN,PHX,LAS,725,730,0,43.0,255.0,0,0,0,0,0
5,2018-01-01,WN,PHX,DEN,600,740,0,78.0,602.0,0,0,0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
69,2018-01-01,YV,DFW,IAH,1210,1327,0,49.0,224.0,0,0,0,0,0
193,2018-01-02,YV,IAH,CLT,728,1059,0,114.0,912.0,0,0,0,0,0
68,2018-01-01,YV,IAH,DTW,1205,1555,0,138.0,1075.0,0,0,0,0,0
55,2018-01-01,YX,LGA,DCA,1125,1253,0,46.0,214.0,0,0,0,0,0
15,2018-01-01,YX,DCA,LGA,700,823,0,39.0,214.0,82,0,0,0,0
21,2018-01-01,YX,MSP,IAH,730,1039,0,139.0,1034.0,0,0,0,0,0

In [313]:
grp_airline.nth(1)

,date,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
airline,,,,,,,,,,,,,
9E,2018-01-01,IAH,DTW,1518,1909,0,132.0,1075.0,0,0,0,0,45
AA,2018-01-01,EWR,CLT,630,835,0,95.0,529.0,100,0,0,0,0
AS,2018-01-01,SEA,SFO,1155,1413,0,101.0,679.0,0,0,0,0,0
B6,2018-01-01,DTW,BOS,600,754,0,79.0,632.0,0,0,19,0,0
DL,2018-01-01,LGA,ATL,759,1034,0,123.0,762.0,0,0,0,0,0
EV,2018-01-05,CLT,LGA,925,1131,1,NaN,544.0,0,0,0,0,0
F9,2018-01-01,LAS,DEN,1940,2238,0,83.0,628.0,0,0,0,0,0
MQ,2018-01-06,ORD,DCA,1330,1621,0,85.0,612.0,0,0,0,0,0
NK,2018-01-01,MCO,EWR,1000,1238,0,125.0,937.0,0,0,0,0,0
OH,2018-01-01,ATL,CLT,1345,1503,0,42.0,226.0,0,0,0,0,0
OO,2018-01-01,DFW,SFO,750,1005,0,216.0,1464.0,0,0,0,0,0
UA,2018-01-01,LAS,EWR,600,1348,0,261.0,2227.0,0,0,0,0,0
VX,2018-01-01,JFK,SFO,1150,1519,0,352.0,2586.0,0,0,0,0,0
WN,2018-01-01,PHX,DEN,600,740,0,78.0,602.0,0,0,0,0,0
YV,2018-01-01,DFW,IAH,1210,1327,0,49.0,224.0,0,0,0,0,0
YX,2018-01-01,MSP,IAH,730,1039,0,139.0,1034.0,0,0,0,0,0

In [314]:
grp_airline.nth(-1)

,date,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
airline,,,,,,,,,,,,,
9E,2018-12-31,CLT,JFK,1400,1603,0,80.0,541.0,0,0,0,0,0
AA,2018-12-31,DFW,SFO,2047,2245,0,194.0,1464.0,0,0,0,0,0
AS,2018-12-31,SEA,DFW,2315,502,0,210.0,1660.0,3,0,3,0,26
B6,2018-12-31,PHX,JFK,2234,509,0,233.0,2153.0,0,0,0,0,0
DL,2018-12-31,ATL,SEA,1959,2237,0,281.0,2182.0,0,0,0,0,0
EV,2018-12-29,DCA,EWR,1610,1740,0,39.0,199.0,0,0,0,0,0
F9,2018-12-31,PHX,ORD,2014,47,0,150.0,1440.0,0,0,0,0,0
MQ,2018-12-31,LGA,DTW,1530,1740,0,96.0,502.0,0,0,0,0,0
NK,2018-12-31,IAH,DEN,2159,2330,0,107.0,862.0,0,0,0,0,0
OH,2018-12-29,DTW,CLT,625,836,0,90.0,500.0,0,0,0,0,0
OO,2018-12-31,PHL,DTW,1722,1916,0,86.0,453.0,0,0,0,0,0
UA,2018-12-31,SFO,EWR,2300,712,0,265.0,2565.0,20,0,0,0,0
VX,2018-03-31,LAX,PHL,2110,516,0,254.0,2402.0,0,0,0,0,0
WN,2018-12-31,ATL,BOS,2200,30,0,116.0,946.0,0,0,0,0,0
YV,2018-12-31,MSP,IAH,1410,1725,0,168.0,1034.0,0,0,0,0,32
YX,2018-12-31,DCA,IAH,1910,2151,0,185.0,1208.0,0,0,0,0,0

In [315]:
df.head()

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0
3,2018-01-01,B6,DTW,BOS,600,754,0,79.0,632.0,0,0,19,0,0
4,2018-01-01,UA,LAS,EWR,600,1348,0,261.0,2227.0,0,0,0,0,0

In [318]:
grp_air_origin=df.set_index(['airline','origin'])

In [320]:
grp_air_origin.head()

                      date dest  dep_time  arr_time  cancelled  air_time  \
airline origin
UA      LAS     2018-01-01  IAH       100       547          0     134.0
WN      DEN     2018-01-01  PHX       515       720          0      91.0
B6      JFK     2018-01-01  BOS       550       657          0      39.0
        DTW     2018-01-01  BOS       600       754          0      79.0
UA      LAS     2018-01-01  EWR       600      1348          0     261.0

                distance  carrier_delay  weather_delay  nas_delay  \
airline origin
UA      LAS       1222.0              0              0          0
WN      DEN        602.0              0              0          0
B6      JFK        187.0              0             83          8
        DTW        632.0              0              0         19
UA      LAS       2227.0              0              0          0

                security_delay  late_aircraft_delay
airline origin
UA      LAS                  0                    0
WN      DEN                  0                    0
B6      JFK                  0                    0
        DTW                  0                    0
UA      LAS                  0                    0

In [323]:
grp_air_origin.groupby(level=0).size()

airline
9E     1037
AA    16779
AS     3244
B6     3816
DL    13104
EV      171
F9     1141
MQ      373
NK     2764
OH      257
OO     2085
UA    11882
VX      429
WN     4912
YV      729
YX     3200
dtype: int64

In [324]:
grp_air_origin.groupby(level=1).size()

origin
ATL    4681
BOS    3727
CLT    2745
DCA    2559
DEN    3712
DFW    3688
DTW    2634
EWR    2875
IAH    2797
JFK    2621
LAS    3205
LAX    4913
LGA    3059
MCO    2995
MSP    2724
ORD    5168
PHL    2294
PHX    2897
SEA    2801
SFO    3828
dtype: int64

In [327]:
df.query('origin=="ATL"').size

65534

In [328]:
#

In [332]:
df=pd.read_csv('cancer_test_data.csv')
df.head()

   patient_id test_result  has_cancer
0       79452    Negative       False
1       81667    Positive        True
2       76297    Negative       False
3       36593    Negative       False
4       53717    Negative       False

In [339]:
grp=df.groupby(['test_result','has_cancer'])

In [342]:
grp.size()

test_result  has_cancer
Negative     False         2077
             True            29
Positive     False          531
             True           277
dtype: int64

In [343]:
grp.size().unstack()

has_cancer   False  True
test_result
Negative      2077     29
Positive       531    277

In [344]:
df.head()

   patient_id test_result  has_cancer
0       79452    Negative       False
1       81667    Positive        True
2       76297    Negative       False
3       36593    Negative       False
4       53717    Negative       False

In [362]:
df1=df.copy()

In [363]:
df1.set_index(['patient_id','test_result'],inplace=True)

In [365]:
df1.head()

                        has_cancer
patient_id test_result
79452      Negative          False
81667      Positive           True
76297      Negative          False
36593      Negative          False
53717      Negative          False

In [369]:
df1.groupby(level=0)

In [372]:
df1.groupby(level=1)['has_cancer'].sum()

test_result
Negative     29.0
Positive    277.0
Name: has_cancer, dtype: float64

In [373]:
#

In [375]:
df=pd.read_csv('flights.csv')
df.head()

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0
3,2018-01-01,B6,DTW,BOS,600,754,0,79.0,632.0,0,0,19,0,0
4,2018-01-01,UA,LAS,EWR,600,1348,0,261.0,2227.0,0,0,0,0,0

In [381]:
df.isnull().sum()

date                      0
airline                   0
origin                    0
dest                      0
dep_time                  0
arr_time                  0
cancelled                 0
air_time               1222
distance                  0
carrier_delay             0
weather_delay             0
nas_delay                 0
security_delay            0
late_aircraft_delay       0
dtype: int64

In [383]:
df=pd.read_csv('stud_grade.csv')
df.head()

   student   Eng  Math  Sci
0    Scott  67.0  78.0   90
1    James  90.0  57.0   60
2      Suf  65.0  45.0   70
3    Peter  78.0   NaN   80
4  Randick   NaN  87.0   67

In [386]:
df.fillna(df.mean(),inplace=True)

In [387]:
df

   student   Eng   Math  Sci
0    Scott  67.0  78.00   90
1    James  90.0  57.00   60
2      Suf  65.0  45.00   70
3    Peter  78.0  66.75   80
4  Randick  75.6  87.00   67
5    Pinto  78.0  66.75   89

In [394]:
df['Total']=df.sum(axis=1)

In [395]:
df

   student   Eng   Math  Sci   Total
0    Scott  67.0  78.00   90  235.00
1    James  90.0  57.00   60  207.00
2      Suf  65.0  45.00   70  180.00
3    Peter  78.0  66.75   80  224.75
4  Randick  75.6  87.00   67  229.60
5    Pinto  78.0  66.75   89  233.75

In [396]:
df.set_index('student',inplace=True)

In [398]:
df.idxmax(axis=0)

Eng        James
Math     Randick
Sci        Scott
Total      Scott
dtype: object

In [400]:
df.idxmin(axis=0)

Eng        Suf
Math       Suf
Sci      James
Total      Suf
dtype: object

In [401]:
#

In [403]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [408]:
filt=df['Pclass']==1
df[filt]['Cabin']

1              C85
3             C123
6              E46
11            C103
23              A6
          ...
871            D35
872    B51 B53 B55
879            C50
887            B42
889           C148
Name: Cabin, Length: 216, dtype: object

In [414]:
df.groupby(['Pclass','Sex']).size().unstack()

Sex     female  male
Pclass
1           94   122
2           76   108
3          144   347

In [413]:
df['Sex'].value_counts(normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

In [415]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [417]:
df['Fare'].std()

49.693428597180905

In [418]:
df['Fare'].mean()

32.2042079685746

In [419]:
df['Fare'].min()

0.0

In [420]:
df['Fare'].max()

512.3292

In [421]:
bins=[0,100,200,300,400,500,600]
c=pd.cut(df['Fare'],bins=bins)

In [423]:
df['Fare_range']=c

In [424]:
df['Fare_range'].value_counts()

(0, 100]      823
(100, 200]     33
(200, 300]     17
(500, 600]      3
(400, 500]      0
(300, 400]      0
Name: Fare_range, dtype: int64

In [425]:
df.groupby(['Pclass','Fare_range']).size()

Pclass  Fare_range
1       (0, 100]      158
        (100, 200]     33
        (200, 300]     17
        (300, 400]      0
        (400, 500]      0
        (500, 600]      3
2       (0, 100]      178
        (100, 200]      0
        (200, 300]      0
        (300, 400]      0
        (400, 500]      0
        (500, 600]      0
3       (0, 100]      487
        (100, 200]      0
        (200, 300]      0
        (300, 400]      0
        (400, 500]      0
        (500, 600]      0
dtype: int64